[
  {
    "comment": "Most probably it will remain range bound. Don't expect too much from it.",
    "sentiment": "neutral",
    "score": 0.5272
  },
  {
    "comment": "may not break this range downside but will stay here some day",
    "sentiment": "neutral",
    "score": 0.3791
  },
  {
    "comment": "Target price??",
    "sentiment": "negative",
    "score": 0.3528
  },
  {
    "comment": "370 -380 soon",
    "sentiment": "positive",
    "score": 0.527
  },
  {
    "comment": "400 then ?",
    "sentiment": "negative",
    "score": 0.3584
  },
  {
    "comment": "It was range bound but now trend has changed... Even if it's sideways for now this week it will give a good Rally...",
    "sentiment": "positive",
    "score": 0.5497
  },
  {
    "comment": "Not anymore DOW theory changed.",
    "sentiment": "neutral",
    "score": 0.4065
  },
  {
    "comment": "Prev. ATH...  But there's BO of C&H in Daily... So it may also go berserk after crossing ATH... But let's see... First target will be previous High...",
    "sentiment": "negative",
    "score": 0.4755
  },
  {
    "comment": "May make a new ATH",
    "sentiment": "positive",
    "score": 0.5402
  },
  {
    "comment": "ATH",
    "sentiment": "positive",
    "score": 0.4742
  },
  {
    "comment": "May give berserk move",
    "sentiment": "positive",
    "score": 0.4989
  },
  {
    "comment": "I'm holding it since 2 years only 3 percent profit till now",
    "sentiment": "positive",
    "score": 0.4422
  },
  {
    "comment": "No worries add more",
    "sentiment": "neutral",
    "score": 0.6483
  },
  {
    "comment": "This post has been downvoted. On behalf of mods, it would not be a good idea to remove this post because people have to know why these are bad faith arguments. Using terms from business finance to disprove points about capitalism doesn't make the capitalistic point weaker. It might do the opposite job and expose the shallowness of the point. This kind of analysis was once done by a certain auditor. We all know what happened to the business and investing climate in this country ever since.  There are numerous problems in OP's argument. Regulation of a business, competition among businesses are all important to capitalism. They've been glossed over or missed. Certainly worth discussing.  I'm not sure OP understands any of the above, but that's not the intention of this comment. This is for everyone else to learn from whatever discussion is possible. Off-topic comments will be removed. People might get banned.",
    "sentiment": "negative",
    "score": 0.7985
  },
  {
    "comment": "We have the cheapest mobile data rates in the entire world, but Mukku-bhai greedy chor :/  I have plenty of issues with the anti-competitive nature of how Jio took off (freebies), but I also acknowledge what good they've done by giving most of the nation affordable internet access.",
    "sentiment": "negative",
    "score": 0.4656
  },
  {
    "comment": ">As Jio celebrates its profits, the Indian consumer is left reeling from rising recharge costs. The days of free or ₹10 data are long gone. Recent tariff hikes, premium plans, and limited validity packs have passed on the real cost of Ambani's network to regular users.  I don't get it. What are you expecting here? Jio is not a charity or a government freebie scheme. They're a for-profit company that exists for the sole purpose of enriching its shareholders.   >Jio may have \"democratized data\", but in reality, we're the ones funding the dividends now. It's like one of Ambani's offshore oil rigs- tapping vast value from deep investments, while the aam aadmi (common man) pays to keep the drilling alive.  That's how every business works! Customers pay for goods/services and some of that money goes to the business owner as profit.",
    "sentiment": "negative",
    "score": 0.5157
  },
  {
    "comment": "Isn't this capitalism? You got a better option?",
    "sentiment": "negative",
    "score": 0.3942
  },
  {
    "comment": "Jio is a business, not a non profit. What did you expect?",
    "sentiment": "neutral",
    "score": 0.4032
  },
  {
    "comment": "I will happily pay Ambani this tariff for life. I remember my college days in 2014 when I needed data the most for studies and Airtel charged 350 Rs per GB. Suddenly after Jio they reduced data prices. Airtel and Vodafone made me Helpless. At the end they are business they will make money. But Airtel sucked blood at other level.",
    "sentiment": "negative",
    "score": 0.4919
  },
  {
    "comment": "High call tarrifs? Lol were you alive before jio came into existence? Do you know how much money the telecom operators looted from customers??  Today you have \"free voice calls\" and one of the cheapest data in the world just cuz of jio.   Op clearly has no idea how to run a business, but surely knows how to give prompts on chatgpt to make a reddit post.  Reliance/Jio never claimed to be non profit.",
    "sentiment": "negative",
    "score": 0.584
  },
  {
    "comment": "It's a beautiful story, they provide nominally cheapest prices in the world, and their service is excellent. It's NAT IPv4 but they give full IPv6. I'm happy with their performance. They didn't hurry with unnecessary 25G speed rollout and have kept cost reasonable for fiber. 5G has been going up for a while though.  If Jio could take over electric grid and provide same uptime and reliability while keeping nominal costs lowest in the world I'd be happy.  I don't care if that makes ambani a trillionaire as long as it means a better world -- cheaper goods for all of us.",
    "sentiment": "positive",
    "score": 0.8882
  },
  {
    "comment": "What are you talking about?   Telephony prices here are among the lowest in the whole world. Cheap data has led to a huge deluge of idiots spending all their time on their phones making/watching reels.  The point of a business isn't to 'recover cost'. That's the job of govt infra, like roads. If anything, direct your anger against that, where we need to pay tolls for bad roads after paying so much road tax  Cheap data has a huge cost, and we are paying it",
    "sentiment": "negative",
    "score": 0.8501
  },
  {
    "comment": "Is OP a bot or just stupid. India has amongst the lowest data cost per GB in the world, largely on account of how JIO bottomed out proces in the mobile data market. Ambani took a bet recouped his investments just like any businesses.  Still you wanna cry.",
    "sentiment": "negative",
    "score": 0.8625
  },
  {
    "comment": "Your question would be valid if you asked why there is no competition in India, why govt allowed a good service provider like BSNL to die without competing with duopoly of Jio's and Airtel's of India. Jio actually showed that there is a business model if you play your customer by providing a good service.",
    "sentiment": "positive",
    "score": 0.4833
  },
  {
    "comment": "What are you smoking maan  If making (minting) money were so easy, then there are many more billionaires in India who could invest 400K crores and make a ton of money.  Investing with a plan and then ensuring that the plan stays on course is a very big task. Just criticizing Ambanis and Adanis (or any entrepreneur ) as profiteers is just lack of knowledge of the very high risks that they are taking to make the project a success.  So is the case of Zomato, Swiggy, Oyo or any of the start-up that we are aware of.     90% of all companies go bust in the first 3 year of inception. So the thriving ones have escaped the jaws of death.",
    "sentiment": "negative",
    "score": 0.7945
  },
  {
    "comment": "[removed]",
    "sentiment": "negative",
    "score": 0.3773
  },
  {
    "comment": "What about monthly recharges which they have made costly? Previously people used to recharge the amount and consume it for months till it exhausted (e.g. 30-100rs for many months). Not everyone needs the internet, many using it, just because it is part of package and not necessity.",
    "sentiment": "neutral",
    "score": 0.4038
  },
  {
    "comment": "Yup. On an investments sub, no less. No shortage of idiots",
    "sentiment": "neutral",
    "score": 0.4969
  },
  {
    "comment": "This. People are idiots. Sorry, I had to say it.",
    "sentiment": "negative",
    "score": 0.7694
  },
  {
    "comment": "One of the biggest QoL betterment we have ever seen as consumers due to capitalism.",
    "sentiment": "negative",
    "score": 0.4769
  },
  {
    "comment": "I'm old enough to remember that a landline STD call in the middle of the day from Chennai to Delhi cost Rs.48 per minute.",
    "sentiment": "positive",
    "score": 0.4442
  },
  {
    "comment": "You're going to be waiting a long time if you think satellite internet is gonna be that cheap.  FFS, it's been announced that promotional plans are going to be around ₹900, and unlimited plans ₹3000 per month.  Do some basic research dude. One google search",
    "sentiment": "negative",
    "score": 0.5368
  },
  {
    "comment": "Starlink with 10 Rs?  Like all the research you've done on Jio and saying this is shocking. Starlink will be a premium service with huge cost it won't be competing with existing ground network players!! Look at the rate in the US , Europe and recently launched in Bangladesh and Srilanka so i expect the same high cost for India. Maybe Jio can bring down the cost of satellite internet using their expertise in mass adoption at scale which other telcos could have done during 3G but AVoID cartel ( Airtel VOdafone IDea ) went greedy and we used to pay ₹250 to ₹350 for 1 GB!! I still remember those Tata Photon, Reliance, MTS, Idea, Airtel 3G dongle charging ₹1500 a month and ₹3000 a month for 40 GB 50 GB data. Starlink will be similar unless competition arrives!",
    "sentiment": "negative",
    "score": 0.7237
  },
  {
    "comment": "Satellites have fractions of bandwidth compared to fibre optics. It will be inherently more expensive.",
    "sentiment": "negative",
    "score": 0.4252
  },
  {
    "comment": "Wonder how much 48₹ would be adjusted to inflation rn.",
    "sentiment": "positive",
    "score": 0.4482
  },
  {
    "comment": "If anyone here thinking imposing Tariffs the way Trump did will solve this problem , it’s Not!",
    "sentiment": "negative",
    "score": 0.7386
  },
  {
    "comment": "If India is buying massive quantities of raw materials and machines from China (incurring a trade deficit with it) and using it to produce things which are exported to markets like Europe, the US, the Middle East, etc., incurring surpluses well ahead of the deficit with China, this would be a good thing - obviously with the caveat that something is idiotic within India for inadequate development of industries producing the raw materials and machine tools, and ought to be rectified via favorable policies and infrastructure development.  💰 •••> 🔧🧪💪 •••>  💰💰💰💰",
    "sentiment": "negative",
    "score": 0.6837
  },
  {
    "comment": "Trade deficit by itself is a meaningless stat. Things will be manufactured where most cost effective. India should be focused on our own production rather than try taxing imports further, and force citizens and companies to spend more than required on goods, and having the government collect and dole it out.",
    "sentiment": "negative",
    "score": 0.6658
  },
  {
    "comment": "The actual trade deficit number is meaningless. We need to focus on manufacturing in India, for which a lot of raw materials, intermediate goods come from China. What India needs is business friendly environment of laws & regulations that encourages businesses to expand & grow. Raw materials, intermediate goods will always be needed from outside.    India should see this as an opportunity to partner with China. We can invite their companies to do joint ventures and start manufacturing in india just like how Vivo, Oppo etc have done.  But we need to do this for all types of goods like consumer goods (phones, washing machine, fridge, kitchen appliances), bikes, cars, buses, trucks, electric vehichles, trains, etc. and even planes (in the long term).",
    "sentiment": "positive",
    "score": 0.4805
  },
  {
    "comment": "The ideal path should be to focus on simple everyday consumption goods like plastic ware, toys, chargers, apparel, shoes, small furniture, lamps, lights, etc. India already manufactures a lot of these products but the manufacturers are not large enough and not cost efficient as compared to Chinese producers. Once we start with chargers, move on to basic circuits, then to simple mobile components and then to complex components that require high level technical skills.  The issue is our manufacturers primarily focus on the domestic market and are unable to compete globally. Most do not even compete nationally, they cater to extremely localised markets. The problem with scaling and achieving cost efficiency is bureaucratic red tape and infra bottlenecks. If the cost of land, power and license is artificially high, then it’s not possible to compete with highly efficient and nimble Chinese manufacturers. Add to it, the high cost of capital and the entrepreneurial energy lost in dealing with entitled Indian babus.   The day political leaders and bureaucrats realise that they are the biggest hurdle to this country’s growth and reciting their functioning, we will start competing. Till then, we are bound to suffer with hand picked tycoons who have carved out critical sectors amongst them supported by powerful leaders and bureaucrats.",
    "sentiment": "negative",
    "score": 0.7158
  },
  {
    "comment": "It will gradually reach trillions. We can't make stuff. Most electronics things labeled 'Make in India' are actually made in China. I have opened some and verified it. Only the label may be Indian, if that.",
    "sentiment": "negative",
    "score": 0.412
  },
  {
    "comment": "wtf is the comment box here talking about, we are not buying any raw material from china, even pharma related raw material that we buy is more of our own incompetence?  Like not saying do full on tariff/ but yeah apply diff ways to reduce trade imbalance.",
    "sentiment": "negative",
    "score": 0.5166
  },
  {
    "comment": "We need policy consistency. Are pakistan and china enemy or no? Yes they are because they are sitting on our land. We have 200 percent tariff on pakistan while nothing on china much. We either need to allow trade with pakistan same as china or have same restrictions with china as pakistan face. This is political thing where economics still important but not sole consideration",
    "sentiment": "negative",
    "score": 0.4815
  },
  {
    "comment": "India was trading giant just like China two thousand years ago and even in Harappan times. But we only want to establish Ram Rajya now.",
    "sentiment": "negative",
    "score": 0.433
  },
  {
    "comment": "What happened to make in India.i guess it remained a Jumla.",
    "sentiment": "negative",
    "score": 0.4157
  },
  {
    "comment": "China doesn't want to buy our world class quantum cowdung that cures cancer, solves global warming and can even protect them from radiation?",
    "sentiment": "negative",
    "score": 0.6733
  },
  {
    "comment": "We export IT services.",
    "sentiment": "positive",
    "score": 0.6317
  },
  {
    "comment": "Fortunately for Indian businessmen, the government of India is a department of corporate sector.",
    "sentiment": "positive",
    "score": 0.6033
  },
  {
    "comment": "Actually its not this simple",
    "sentiment": "neutral",
    "score": 0.5335
  },
  {
    "comment": "An argument can be made that it’s important to protect industries until they grow but we’re well past that point and government officials need tycoons to make them look good so we are stuck with them. You can also argue that a trade deficit with a country that weaponises trade (long before Trump) is not good for national security especially as it sees India as an economic rival and wants to prevent a similar rise (and has arguably succeeded but babe more to do with our failings). Starved of good import options, Indians will also parallel import. The only real way for Indian development is through industrial development and through remittances and property development as the world will need young Indians whether they like it or not",
    "sentiment": "negative",
    "score": 0.8454
  },
  {
    "comment": "We are mostly good at producing people and exporting them. Increasingly, in developed countries the sentiments have soured against those imports.",
    "sentiment": "positive",
    "score": 0.8207
  },
  {
    "comment": "Trade deficit is meaningless stats.  Then in the next line goes on to say things will be mfd where most cost effective. What the hell are above points?  See the china keeps its market closed our services based companies do not get any access.  They use their citizens money to subsidise their industries.  Why should not India do that?  Like seriously bro it’s china the poster child of anti free market policies?",
    "sentiment": "negative",
    "score": 0.7598
  },
  {
    "comment": "Imagine if we had 200 bn surplus, would we be a better nation?",
    "sentiment": "positive",
    "score": 0.4743
  },
  {
    "comment": "Thats bull shit . Country with trade deficit will lose the value of currency 😞😞.",
    "sentiment": "negative",
    "score": 0.9417
  },
  {
    "comment": "How will you pay if every Indian only wants to buy imported products? By selling kidneys? Also how will you provide jobs to people if you buy foreign products & create job opportunities for people outside.",
    "sentiment": "positive",
    "score": 0.4736
  },
  {
    "comment": "My tutor had visited china and he told us how china has manufacturing centres for every range of customers . From 5 Rs to 1 crore they manufacture for all groups of society .",
    "sentiment": "positive",
    "score": 0.6159
  },
  {
    "comment": "Lol they are biggest supplier of most raw materials and finished goods like API, rare earth, mobile phones etc..  We can provide low cost medicine for billion people, thanks to API from them.",
    "sentiment": "positive",
    "score": 0.8266
  },
  {
    "comment": "We can thank the red tapes and bureaucracy for that. It has made it impossible to start a business in India.",
    "sentiment": "negative",
    "score": 0.5198
  },
  {
    "comment": "There is nothing wrong with trying to establish ram rajya. Trying to be a manufacturing powerhouse and also trying for ram rajya can go hand in hand. It is a slow process but we will get there, one step at a time.",
    "sentiment": "negative",
    "score": 0.4149
  },
  {
    "comment": "Things were much worse during secular raj",
    "sentiment": "negative",
    "score": 0.9166
  },
  {
    "comment": "lol, corporate India is shit.zero ability to innovate and do things for themselves",
    "sentiment": "negative",
    "score": 0.9395
  },
  {
    "comment": "Elaborate, then.",
    "sentiment": "positive",
    "score": 0.71
  },
  {
    "comment": "Economic rival? More like geopolitical rival",
    "sentiment": "negative",
    "score": 0.5286
  },
  {
    "comment": "we'll that's what we keep trying again and again, however the most growth we experienced was when we experienced economic liberation.  Even if we assume that's the way to go, Indian gov still has tariffs on Machinery, so why are we doing that why not import the best quality machines from china, Germany, japan, America and use them to make factories in India.  What about raw material, why don't we have zero tariff on raw material. Why not import cheap material from all over the world and make the finished goods here in India.",
    "sentiment": "negative",
    "score": 0.4847
  },
  {
    "comment": "Start small, you don't have to manufacture the entire laptop you can at least manufacture fans used in the laptop right?",
    "sentiment": "neutral",
    "score": 0.4047
  },
  {
    "comment": "What you described is what happens when the government artificially increases prices of imports by taxing us. That money saved from doing things worse could’ve been invested in producing things of value both internally and for export.",
    "sentiment": "negative",
    "score": 0.665
  },
  {
    "comment": "Did you read the word incompetence there? Rare earth metals sure. But backpanal of mobile/ wrapper of drugs is not the raw material you think it is.  But raw material word is being thrown out like we are doing value addition of highest level eg importing raw iron ore and then making steel  .(type krte hue ajjeb laga, labour arbitrage ho nahi raha hai, inko value addition pe khelna hai)",
    "sentiment": "negative",
    "score": 0.5966
  },
  {
    "comment": "[deleted]",
    "sentiment": "negative",
    "score": 0.3849
  },
  {
    "comment": "[deleted]",
    "sentiment": "negative",
    "score": 0.3849
  },
  {
    "comment": "whataboutery is all you can do.  The previous govt was voted out as current govt promised to improve India, has it improved like they promised?",
    "sentiment": "negative",
    "score": 0.5339
  },
  {
    "comment": "ok. first it points to failure of Make in India as a program that is the govt PLI scheme to drive innovation and development of indigenous products. Now, let's keep that aside. The trade deficit with China is not only for raw materials it's also for finished goods. A lot if Indian products don't meet the quality including pharma, largest chunk of export from India is services. The trade deficit that is increasing is for consumption of products in India due to excise policy and GST regulations of products being produced in India. Indian consumption is way higher for chinese products. The other point article makes is around that. The govt was all ghungoo about not importing from China even banning apps but now the deficit is at all time high!",
    "sentiment": "negative",
    "score": 0.7056
  },
  {
    "comment": "Beats me. I assume votes.",
    "sentiment": "positive",
    "score": 0.6078
  },
  {
    "comment": "I agree. Instead of thinking too big, we should start making small components that’s used for end products. That’s how Huawei started 30 years back and is now a global behemoth.",
    "sentiment": "positive",
    "score": 0.4475
  },
  {
    "comment": "That’s not how economy works. India has trade deficit with most countries and crisis in balance of payment. As a result Indian rupee isn’t trusted by anyone in the world for international settlements. The only reason Indians haven’t experienced Venezuela type inflation is because of NRI remittances and IT services revenue that build foreign reserves to pay for essential imports such as oil, gas etc.",
    "sentiment": "negative",
    "score": 0.6841
  },
  {
    "comment": "The first thoughts of government workers are the food in the canteen during break and leave time. Lol",
    "sentiment": "positive",
    "score": 0.4035
  },
  {
    "comment": "We need our own DOGE...but there are some government departments which severely need manpower... For example - Railway motorman/Police services etc",
    "sentiment": "negative",
    "score": 0.6045
  },
  {
    "comment": "Indian constitution does not embrace negative secularism, i.e., separation of the state affairs from religion. And the problem with Ram Rajya is that it will lead us to become another Pakistan.",
    "sentiment": "neutral",
    "score": 0.5234
  },
  {
    "comment": "Oh, I should have been clear. I was implying the principles and morals that are told to be the bedrock of ram rajya. Surely, that is not something the constitution chides. Please do not bring religion into this. Will make it a whole lot messier.",
    "sentiment": "negative",
    "score": 0.7475
  },
  {
    "comment": "Both Governments continue to argue about caste and reservations to care about any real issues.",
    "sentiment": "negative",
    "score": 0.5085
  },
  {
    "comment": "Wasn't the original guy not doing the exact same thing lmao.",
    "sentiment": "neutral",
    "score": 0.4619
  },
  {
    "comment": "Consumption of finished goods is bound to grow in a growing economy. However, for your argument to hold, you need to compare the trade volumes of imported finished goods against the trade volumes of raw material imports from China. If the latter is dominated by the former, you’d be correct.  You’d also need to separate machinery (includes industrial: commercial equipment) from consumer goods (domestic), as both are finished goods, but only one can help with subsequent exports.  Do you have this data?  Based on GTRI data, in 2023-24, nearly 90% of imports into India from China comprised of machinery and intermediate goods (chemicals, packaging material, etc.).  [https://gtri.co.in/DisplayFlagshipReports.aspx?ID=39&utm_source=chatgpt.com](https://gtri.co.in/DisplayFlagshipReports.aspx?ID=39&utm_source=chatgpt.com)",
    "sentiment": "negative",
    "score": 0.4208
  },
  {
    "comment": "Trust in indian rupee has nothing to do with international settlements. Usd is the reserve currency for almost all countries of the world",
    "sentiment": "neutral",
    "score": 0.346
  },
  {
    "comment": "\\>India has trade deficit with most countries and crisis in balance of payment     India has a trade deficit in goods but surplus in services and capital account. Bop crisis would be if there was deficit in both. Indian rupee isn't widely used but that doesn't mean there is no confidence in it",
    "sentiment": "negative",
    "score": 0.673
  },
  {
    "comment": "Well, isn't it true for private workers as well? SBI guys tend to thousand people per day. They are not overpaid at all. It is just that they are also victims of the system. It is not like that the corruption doesn't exist in private sector.",
    "sentiment": "negative",
    "score": 0.7453
  },
  {
    "comment": "You have contradicted yourself in your comment.",
    "sentiment": "negative",
    "score": 0.7603
  },
  {
    "comment": "Where we need government employees:  Judges.  Police.  Forensics and pathology.  Railway motormen.  Schoolteachers, esp. Rural.  Where we DON'T need more government workers:  Property taxes, registrations, etc. Which are hotbeds for corruption.  GST registration, company certificates, etc.   Basically registration and documentation services, which could be done quite easily, should be outsourced - like the passport office outsources documentation to KPOs. Monitoe and review casea, with 1 govt officer under video surveillance for 100 private sector workers, so that bribes cannot be taken or sought.   Government employees should only be present in those services which require actual physical and mental work, not those which are opportunities for rent seeking.",
    "sentiment": "negative",
    "score": 0.7054
  },
  {
    "comment": "[deleted]",
    "sentiment": "negative",
    "score": 0.3849
  },
  {
    "comment": "and yen, yuan and euro. Sometimes dirham also when Russia asked India to pay in dirham for oil instead of rupee. Russia has accumulated billions of rupees that it can’t use.",
    "sentiment": "negative",
    "score": 0.5986
  },
  {
    "comment": "That was an affirmation, but sure.",
    "sentiment": "neutral",
    "score": 0.4653
  },
  {
    "comment": "But honestly, why? 100 crores seems like such a small amount, that Reliance could shore up that capital themselves or via Ambani himself. Why resort to SBI for what seems like a small amount?",
    "sentiment": "negative",
    "score": 0.4457
  },
  {
    "comment": "Is it around 2018?  Check if an SBI top dog joined Reliance post retirement. (Hint: she did)",
    "sentiment": "negative",
    "score": 0.4209
  },
  {
    "comment": "SBI expertise is data of each PAN card holder, donated to JIO. The 4% return is meaningless, the Former CEO made money, got kickback, and jio ran a PR for her.",
    "sentiment": "negative",
    "score": 0.4942
  },
  {
    "comment": "No signs of crony capitalism or government favoritism to support private donors detected — everything appears transparent and above board.",
    "sentiment": "neutral",
    "score": 0.5731
  },
  {
    "comment": "SBI putting 100cr in jio ....🤐 LIC investing shit loads of crores in ADANI group......💕",
    "sentiment": "negative",
    "score": 0.683
  },
  {
    "comment": "Most large banks have a private equity investment portfolio. This just looks like a bad investment. Equity investments are allowed to go bad. Shit happens.",
    "sentiment": "negative",
    "score": 0.8987
  },
  {
    "comment": "What is the Jio Payments Bank's valuation now? Is the sale of 104cr in sync with that? That should be the check, not a comparison with FD.",
    "sentiment": "neutral",
    "score": 0.5188
  },
  {
    "comment": "Well back in 2018, payment apps and payment banks were all the rage. There was an expectation that they could scale faster, since they had looser regulations. Of course that’s not what really happened, payment banks didn’t perform very well, and Jio’s payment ecosystem didn’t take off the way PhonePe or Gpay did.   The startup didn’t scale and SBI got a small return on its investment. This just seems like a normal investment into a startup that didn’t yield much because the startup didn’t scale. I think you’re reading too much into it.",
    "sentiment": "negative",
    "score": 0.5116
  },
  {
    "comment": "I'm just spit balling based on the info you provided. Maybe SBI thought jio payment bank could be something like a paytm and invested money early hoping to own a significant portion of a future big company. Unfortunately when other similar companies like phonepe and paytm took off, this particular venture failed to live up to its potential. They realized it now and got out of it and ended up making a decent return on it instead of losing money. They invested 79 cr and got 105 cr, that doesn't sound too bad unless you say if they invested it elsewhere they could've made more money. They invested in jio when jio was the undisputed leader in the sim card market and they had expressed plans to expand into other related fields. Considering the lack of market share of jio holds it's a wonder SBI didn't lose money in this venture. We don't need to look at everything as a big conspiracy, maybe there were some shady dealings that happened here but you haven't established this in any meaningful way.",
    "sentiment": "negative",
    "score": 0.7263
  },
  {
    "comment": "This is not norma",
    "sentiment": "neutral",
    "score": 0.7579
  },
  {
    "comment": "Ambani is a worst of all plagues. He is looting common man’s money and using it for his own benefits",
    "sentiment": "negative",
    "score": 0.9553
  },
  {
    "comment": "Great post op. Thanks",
    "sentiment": "positive",
    "score": 0.9153
  },
  {
    "comment": "79crores for 4.57% even home loans are expensive this is how they control the system 1% holding 40%",
    "sentiment": "negative",
    "score": 0.4358
  },
  {
    "comment": "This seems to be a non story.. as far as investing in start up goes banks do that selectively. And investing in a startup with reliance backing seems as safe as it gets.",
    "sentiment": "neutral",
    "score": 0.6184
  },
  {
    "comment": "SBI made a bad call, it’s that simple. People lose money all the time in equities. Not a crime, just incompetence.",
    "sentiment": "negative",
    "score": 0.8223
  },
  {
    "comment": "Have dealt with a few banks and have to say SBI has been one of the worst . Offices look like there was a raid previous week. Call centre speaks like they talking at home . Mediocre",
    "sentiment": "negative",
    "score": 0.9331
  },
  {
    "comment": "Jio gets SBI's expertise. SBI hoped to get decent returns.",
    "sentiment": "positive",
    "score": 0.5925
  },
  {
    "comment": "Jio gets SBI's expertise. SBI hoped to get decent returns.",
    "sentiment": "positive",
    "score": 0.5925
  },
  {
    "comment": "Jio gets SBI's expertise. SBI hoped to get decent returns.",
    "sentiment": "positive",
    "score": 0.5925
  },
  {
    "comment": "Damn! I was trying to remember hearing news sbi chairman joined reliance  board of directors! Arundhati bhattacharya played this very well.",
    "sentiment": "negative",
    "score": 0.8787
  },
  {
    "comment": "This needs to be higher up!",
    "sentiment": "positive",
    "score": 0.6726
  },
  {
    "comment": "nothing to see here folks. Reliance and government are always, I mean always, at arms length. /s",
    "sentiment": "neutral",
    "score": 0.5193
  },
  {
    "comment": "Private company valuations are done by people which can be bribed and manipulated. If the regulatory companies who rate bonds can be bribed, we can’t trust anyone!",
    "sentiment": "negative",
    "score": 0.7579
  },
  {
    "comment": "You are right unless It is made to look like just a bad call made by the biggest bank of the country on the richest man in the country.",
    "sentiment": "negative",
    "score": 0.7503
  },
  {
    "comment": "SBI's expertise. \"lunch ke bad ana\"",
    "sentiment": "negative",
    "score": 0.6637
  },
  {
    "comment": "Bro, u echo",
    "sentiment": "negative",
    "score": 0.4708
  },
  {
    "comment": "This is clear quid pro quo. She should be dragged to courts for this.",
    "sentiment": "negative",
    "score": 0.5906
  },
  {
    "comment": "Well they are more profitable than RIL.",
    "sentiment": "positive",
    "score": 0.4555
  },
  {
    "comment": "😂😂",
    "sentiment": "positive",
    "score": 0.4161
  },
  {
    "comment": "How dare you use logic and draw connections. Don't you see the Best Female CEO with PR can never be corrupt.",
    "sentiment": "positive",
    "score": 0.4577
  },
  {
    "comment": "Because they have over 26,000 branches.",
    "sentiment": "positive",
    "score": 0.4189
  },
  {
    "comment": "I've said this before; you write well, hope you are able monetize this skill",
    "sentiment": "positive",
    "score": 0.6808
  },
  {
    "comment": "Interesting read",
    "sentiment": "positive",
    "score": 0.7305
  },
  {
    "comment": "If reliance is involved then it's pretty sure no action will be taken, just like adani Hindenburg case. Modi hai toh munkin hai!!!",
    "sentiment": "negative",
    "score": 0.561
  },
  {
    "comment": "Great read OP !  Wishing you all the success for the hardwork you are putting in.   I did not understand one part - the money that reliance paid BG, how was it actually used? If BG was in the business of giving away preferential shares, that won't cost them any money, right?",
    "sentiment": "positive",
    "score": 0.571
  },
  {
    "comment": "Thanks, an interesting read",
    "sentiment": "positive",
    "score": 0.977
  },
  {
    "comment": "Good read. How do you pick these stories?",
    "sentiment": "positive",
    "score": 0.9158
  },
  {
    "comment": "Only in India. Can it be more brazen?",
    "sentiment": "positive",
    "score": 0.3925
  },
  {
    "comment": "I thought OP copied an article from somewhere, well just realized OP writes well , very well indeed.",
    "sentiment": "positive",
    "score": 0.8948
  },
  {
    "comment": "Very well written! I like the Matt Levine esque style you’re going forb",
    "sentiment": "positive",
    "score": 0.9464
  },
  {
    "comment": "Why there is no prison sentence for manipulating market ?",
    "sentiment": "negative",
    "score": 0.5131
  },
  {
    "comment": "Hi your all articles are amazing. Wish you get all the sucess.  Can you recommend more sources, outlets for the people who like your writing. Mostly related to Indian Finance sector. I do like ken but its a little expensive for me.",
    "sentiment": "positive",
    "score": 0.8513
  },
  {
    "comment": "Bhai, padh ke mazaa aaya... You write Good 😊😊",
    "sentiment": "positive",
    "score": 0.876
  },
  {
    "comment": "Great read, love the way it is explained, kudos!",
    "sentiment": "positive",
    "score": 0.9693
  },
  {
    "comment": "Your posts are refreshing in these subs, boss. Great work!",
    "sentiment": "positive",
    "score": 0.7188
  },
  {
    "comment": "Well written",
    "sentiment": "positive",
    "score": 0.4075
  },
  {
    "comment": "It really deserves a Net Flix series 😤",
    "sentiment": "negative",
    "score": 0.6704
  },
  {
    "comment": "Old technique going back to the eighties.",
    "sentiment": "positive",
    "score": 0.4009
  },
  {
    "comment": "Thanks! I hope so too :) Ideally directly from readers. Anything else will be a compromise on quality.",
    "sentiment": "positive",
    "score": 0.9634
  },
  {
    "comment": "Alerting Indian Citizens Being Defrauded = Anti-National",
    "sentiment": "negative",
    "score": 0.6631
  },
  {
    "comment": "That’s what I was thinking",
    "sentiment": "positive",
    "score": 0.3722
  },
  {
    "comment": "Thank you!  The money that Reliance gave BG was missing from its cashflow statements. So that's for SEBI to find out where the money actually went.  The money that the 41 people gave BG remained in the company's bank accounts.",
    "sentiment": "positive",
    "score": 0.7445
  },
  {
    "comment": "This one was born out of a SEBI order. Otherwise it's news breaks that I find interesting and feel a certain angle has been missed by the media. There's a lot of them tbh!",
    "sentiment": "negative",
    "score": 0.6832
  },
  {
    "comment": "Cuz prison is meant for average thugs not the biggest thugs",
    "sentiment": "neutral",
    "score": 0.4677
  },
  {
    "comment": "This is a tough question for two reasons: I don't report for my pieces, so I frequently rely on other outlets for newsbreaks and reportage. At the same time, I sometimes find Indian financial media severely lacking, both in the depth of coverage as well as in presentation. So I don't know what to recommend :)  Ken is decent, I used to work there. If I find value in 1 article every couple of months, that's good enough for me.  Zerodha is doing a great job with Daily Brief. Young, smart folks. Fresh, deep takes. Lot of experimentation, which is welcome.  Bloomberg, when their US-based writers write about India, do a fabulous job. Their India-based writers, not so much.  Moneycontrol and ET are always great for newsbreaks and displaying the facts. Not so much for analysis.  Make of this info what you will :)",
    "sentiment": "positive",
    "score": 0.6573
  },
  {
    "comment": "Thank you! Hope you've subscribed on https://boringmoney.in :)",
    "sentiment": "positive",
    "score": 0.9706
  },
  {
    "comment": "Thank you! Hope you've subscribed to https://boringmoney.in :)",
    "sentiment": "positive",
    "score": 0.9693
  },
  {
    "comment": "[deleted]",
    "sentiment": "negative",
    "score": 0.3849
  },
  {
    "comment": "Instead create YouTube videos. Such things go viral & you will earn better. Amazing free read.",
    "sentiment": "positive",
    "score": 0.6625
  },
  {
    "comment": "So the plot thickens",
    "sentiment": "negative",
    "score": 0.455
  },
  {
    "comment": "You know what, I'm seriously considering it. Do you mind sharing which are the podcasts that you like? Both finance and otherwise.",
    "sentiment": "positive",
    "score": 0.4305
  },
  {
    "comment": "Videos are a different skillset entirely. I'd be happier with a small, discerning readership versus a YouTube channel where the incentives are heavy on clickbait and # of views.",
    "sentiment": "positive",
    "score": 0.4776
  },
  {
    "comment": "[deleted]",
    "sentiment": "negative",
    "score": 0.3849
  },
  {
    "comment": "Oh that was you! I remember, thanks!",
    "sentiment": "positive",
    "score": 0.9749
  },
  {
    "comment": "Seems like a way to pad the books for transactions.  Based on my level 1 knowledge of balance sheets,  Reliance retail selling stuff will create trade receivables, cash conversion cycle ratio, asset turnover ratio, sales, profit, free cash flow  Jio leasing buying it will increase assets and inventory, reduce tax liability, offset profits by claiming depreciation  Leasing inventory out to jio will increase revenues, profits, build a business history, keep 100% of assets and have next to 0% operational costs and still get revenue, increase ROA, ROCE, and finally jio financial won’t just be a hype company but an actual business o n the books.  Reliance Jio ( the buyer) leasing equipment will reduce legal liability, create business expenses so shareholder profit *mightbe* reduced on reliance industries side so promoters can pocket more via other subsidiaries, tax liability is further reduced in expenses.   Also, this means the other companies will have good standalone balance sheets, instead of just good consolidated ones, setting them up as individual entities that can borrow money, leverage their non existing assets to increase influence, outreach and capital  Or I’m a complete moron and all this is garbage. Billionaires don’t do infinite money glitches.  /s",
    "sentiment": "positive",
    "score": 0.4133
  },
  {
    "comment": "Hera pheri 5 ka plot mil gaya",
    "sentiment": "positive",
    "score": 0.5498
  },
  {
    "comment": "Wow. Thanks!",
    "sentiment": "positive",
    "score": 0.9781
  },
  {
    "comment": "What benefit do they have by rotating capital like this ?  I get that jio leasing will get some stable revenue on paper but apart from that is there a tax benefit ? Or is this a artifical pump for jio leasing ?",
    "sentiment": "negative",
    "score": 0.4134
  },
  {
    "comment": "Not a huge fan of related party transactions on a large scale basis",
    "sentiment": "neutral",
    "score": 0.7625
  },
  {
    "comment": "Enron vibes",
    "sentiment": "positive",
    "score": 0.4553
  },
  {
    "comment": "Can't wait to post in Jiodit using my Jio smart phone on Jio network talking to Jio AI agents and driving Jio cars to go see movies at Jio theaters and drink at Jio clubs soon.",
    "sentiment": "positive",
    "score": 0.4689
  },
  {
    "comment": "I feel dirty if I invest in Indian conglomerates. So much self-dealing.",
    "sentiment": "negative",
    "score": 0.6429
  },
  {
    "comment": "I know Bosch has been doing something similar for decades",
    "sentiment": "positive",
    "score": 0.3934
  },
  {
    "comment": "If they want to lend me a router, I am fine with it. As long as they lend me the router that I want and I get to keep it after I've paid it off.",
    "sentiment": "positive",
    "score": 0.6071
  },
  {
    "comment": "Really insightful!",
    "sentiment": "positive",
    "score": 0.9467
  },
  {
    "comment": "you can never take a trader out of a person   at its core reliance industries is just a trading business",
    "sentiment": "neutral",
    "score": 0.51
  },
  {
    "comment": "Finally a quality reply.",
    "sentiment": "positive",
    "score": 0.7479
  },
  {
    "comment": "Good analysis, though \"Reliance Jio ( the buyer) leasing equipment will reduce legal liability, create business expenses so shareholder profit *mightbe* reduced on reliance industries side so promoters can pocket more via other subsidiaries, tax liability is further reduced in expenses.\" - there is not much to reduce legal liability here. As an end user I get the router from jio so I could care less how they acquired it. The entire pass the router around is mostly financial engineering that RIL has been doing since their polyester prince days. Earlier they did for under the table cash nowadays they do it to prop up EBITDA",
    "sentiment": "negative",
    "score": 0.4506
  },
  {
    "comment": "The reasons aren't clear to me yet. We'll know with time. One thing that is happening is that Reliance Retail will look like a much larger business than it actually is.",
    "sentiment": "negative",
    "score": 0.4989
  },
  {
    "comment": "The profit on router resale stays in house in Jio Leasing which would otherwise not exist (Jio buying directly from Manufacturer vs Jio buying from RRL and paying them a margin). Now these routers will be given away at throw away initial cost (like free or Rs99 or something like that) and they will add the cost to the plan technically making it revenue of Jio.   They claim depreciation on those routers via Jio Leasing, show a huge loss on the leasing business to save tax. Jio financial will be in a nett loss after this but a smartly timed deal before next years results will pump cash into Jio financial and keep it afloat. Viola Money from thin air and Tax savings",
    "sentiment": "negative",
    "score": 0.741
  },
  {
    "comment": "depreciation is the primary reason, thereby create a taxable loss, yet a positive operating cash flow. EBITDA is the number used to value and fund companies so that get's rising but net income not so much.",
    "sentiment": "positive",
    "score": 0.5044
  },
  {
    "comment": "Please drink campacola while at Jio club & did you pay for everything using with Jiocash?  Btw Just to complete the loop the smartphones will be shipped via adani port and the electricity from adani power and shops will be constructed using Ambuja cement.",
    "sentiment": "positive",
    "score": 0.4296
  },
  {
    "comment": "That's only coz tou don't know how foreign firms operate",
    "sentiment": "negative",
    "score": 0.5684
  },
  {
    "comment": "Can you shed more light on what they did during polyester prince days for under the table cash ? Any resources you would recommend",
    "sentiment": "negative",
    "score": 0.4626
  },
  {
    "comment": "reducing legal liability is necessary because if a modem short circuits, causes a fire or your connection gets dropped due to a faulty modem and you lose out on a deal worth crores due to a time sensitive event, you can absolutely sue the company that makes the gadget that caused your problem.   But you bought from jio, you sue jio, but they say they don’t own/make the product, they just lease it so you have to sue jio leasing which is a subsidiary so you have to sue jio financial which says we own but do not make so you sue reliance retail which sells it but doesn’t manufacture so you have to sue reliance industries which has completed liability but excellent lawyers so your case is on court for 10-20 years.    You’ve just spent 1-2 years and 10 lakhs to fight a case over a 1000 rupees modem. And the verdict is, we’ll pay for a new modem for you coz we can’t be held liable for you using crores, why didn’t you have our jiofi modem to mitigate connection risk?   Google did something similar when they created alphabet as a subsidiary and alphabet owns Google and Google owns alphabet and it becomes a web so complicated even the SEC can’t unravel it due to headquarters also being outside the country so you don’t even have access to all information.",
    "sentiment": "negative",
    "score": 0.7191
  },
  {
    "comment": "Setting the stage for Reliance Retail spin-off & listing?",
    "sentiment": "positive",
    "score": 0.376
  },
  {
    "comment": "You can download the book itself from the dark web, although nowadays it is easier to find. The book itself was banned by the Ambanis' muscle power.",
    "sentiment": "negative",
    "score": 0.5385
  },
  {
    "comment": "Not going to get into a back and forth but contract law is pretty straight forward - my contract is with the guy who provided the router as part of service unless of course there are multiple contracts involved. And pretty much any contract related to electric components absolves a company from liability the day you sign up, you can look up the one you signed with your internet provider. The lawsuit will not be entertained beyond the initial hearing. If reliance industries has great lawyers then so does every subsidiary of theirs.",
    "sentiment": "negative",
    "score": 0.4761
  },
  {
    "comment": "Could be!",
    "sentiment": "positive",
    "score": 0.6401
  },
  {
    "comment": "What's the name of the book?",
    "sentiment": "negative",
    "score": 0.4101
  },
  {
    "comment": "The investable market in India is still very small compared to the US. As a small investor with limited funds you can diversify and hold unheard of small and micro caps. But as a mutual fund with ₹30,000+ crores for example, you'd have to hold some of the big names you mentioned to be able to fully deploy in the market while protecting your downside.",
    "sentiment": "positive",
    "score": 0.4133
  },
  {
    "comment": "there is a new mutual fund by motilal oswal targeting microcap 250. That might be something you're looking for- underdogs with high potential, but also high risk high reward.",
    "sentiment": "negative",
    "score": 0.4337
  },
  {
    "comment": "It all depends on the type of Mutual Fund. There are many categories to it. You just might be looking at some broad market cap based Funds, so they will have an overlap. Now if you want to look for funds sector/industry wise, you should look into sectoral funds and thematic funds.  Sometimes, even these funds are given a leniency towards how much percentage of the fund can allocated to the theme/sector of the funds goal, lets say 80%. The remaining 20% they can take a safe bet and allocate that to some bluechips for safety.   To surmise, look at the type of fund, and you'll understand the stocks that could potentially be under its portfolio.  More detailed info: [https://www.amfiindia.com/investor-corner/knowledge-center/SEBI-categorization-of-mutual-fund-schemes.html](https://www.amfiindia.com/investor-corner/knowledge-center/SEBI-categorization-of-mutual-fund-schemes.html)",
    "sentiment": "positive",
    "score": 0.4267
  },
  {
    "comment": "In india single mutual can't invest more than 10 percent of its aum in single stock. Also mutual fund house can't hold more than 10 percent ownership of single company  Let say you put money in large cap fund.  Adhering to this condition and large cap universe is just of 110 stocks it will create same portfolio with different weight ages only. That is why indexing will work and beat",
    "sentiment": "negative",
    "score": 0.4339
  },
  {
    "comment": "That link was immensely helpful, thank you!",
    "sentiment": "positive",
    "score": 0.9806
  },
  {
    "comment": "[deleted]",
    "sentiment": "negative",
    "score": 0.3849
  },
  {
    "comment": "They're probably going to ruin cc",
    "sentiment": "negative",
    "score": 0.62
  },
  {
    "comment": "Have sources on this one. Unacademy wanted to monetise codechef, and had high hopes for it. It failed to generate revenue, and Unacademy decided to shut it down and let go of all the employees.    However, it was later negotiated to the current situation, with unacademy trying one last time to make some money off codechef.    Ideally It can be seen as two different transactions:     1. Unacademy buys codechef for X amount, loses it due to lack of monetisation opportunities.    2. Unacademy invests 3Crores in a separate entity Codechef.",
    "sentiment": "negative",
    "score": 0.5861
  },
  {
    "comment": "This comment has been removed to protest Reddit's hostile treatment of users, mods and third party app developers.",
    "sentiment": "negative",
    "score": 0.8603
  },
  {
    "comment": "Sam Altman did the same thing but in reverse, he created a for profit arm of OpenAI for Microsoft.",
    "sentiment": "positive",
    "score": 0.4105
  },
  {
    "comment": "Non-profit doesn't mean literally means - no profit. It simply means unlike for profit companies the profits aren't attributable to owner(s) or shareholder(s). Some of the non-profits are so profitable that it is mind boggling. These non-profits are gold mine for the employees/trustees. The world's largest retailer is a non-profit - Ikea.  It is more likely that Unacademy needs to show profitability maybe to go public or what-have-you, and sees the golden goose called CodeChef which makes money but cannot be attributed to the consolidated company. So, they want to show y% of x profit instead of 0% of x profit. For that they need CodeChef to go from non-profit to for profit. But employees are a bottleneck because non-profits, while cannot generate profit for the \"owners\" as there is no ownership, can pay huge salaries to \"employees\". So, the only way to make it work is to sweeten the pot for the employees who are \"losing\".  Maybe sometime later they can pitch this additional \"value\" to investors - public or private and get even more money.",
    "sentiment": "negative",
    "score": 0.5623
  },
  {
    "comment": "For those who prefer listening over reading, I've got a really good voiceover for this post. You can check it out on the OG [link](https://boringmoney.substack.com/p/unacademy-codechef-for-profit) or on [Spotify](https://open.spotify.com/show/3CDe9AsM4DbXeiGXcqfA7o).",
    "sentiment": "positive",
    "score": 0.8715
  },
  {
    "comment": "Let me clarify something, a not-for-profit company is not against making profits rather it cannot distributed accumulated profits to shareholders. So effectively a public trust with limited liability.  Since they do not avail any government benefits available to Not-for-profit companies, converting back to a for profit company is no big deal. They have infused new capital in a subsidiary with hopes of earning returns.",
    "sentiment": "negative",
    "score": 0.4687
  },
  {
    "comment": "Good read. Keep up the good stuff my man!",
    "sentiment": "positive",
    "score": 0.9763
  },
  {
    "comment": "The best coding platform from india :(",
    "sentiment": "positive",
    "score": 0.6718
  },
  {
    "comment": "I dread the day GFG becomes for profit, I will shit my pants",
    "sentiment": "negative",
    "score": 0.8413
  },
  {
    "comment": "I don't have much to add, just here to say that I've been following your newsletter for a while now, and it's honestly one of my favourite reads!",
    "sentiment": "positive",
    "score": 0.6516
  },
  {
    "comment": "A very good read.",
    "sentiment": "positive",
    "score": 0.9852
  },
  {
    "comment": "Good article OP, I subscribed to your newsletter!  You might wanna add it in the end again so that people remember to sign up for your email!",
    "sentiment": "positive",
    "score": 0.9049
  },
  {
    "comment": "Second that. Its also the most toxic. Also edtech had everything except ed and tech parts. Know this as I have personally spent almost a decade working in it.",
    "sentiment": "negative",
    "score": 0.8696
  },
  {
    "comment": "It was already ruined after the acquisition, they started monetizing anything and everything, even had a premium plan to get editorials 1 day before other users.",
    "sentiment": "negative",
    "score": 0.5778
  },
  {
    "comment": "Thanks for the tea!",
    "sentiment": "positive",
    "score": 0.9809
  },
  {
    "comment": "IMO, there needs to be a cultural change, if you have petabytes of data and no one uses it, it's a waste of resources, nothing more.  People in India LOVE spending on education whether it provides actual value or not. Heck there are too many free resources for most topics on the internet and people aren't using them enough.  Instead they'll spend 50k on a course and expect the information to walk into their brain.",
    "sentiment": "negative",
    "score": 0.5741
  },
  {
    "comment": "> The whole point of education is developing critical thinking and learning ability.  That is true if you're an idealist. The reality is, most people think education is a means to get more income (and honestly it rightfully is.) For lots of people, the only way to pull up in society is education and that's why its valued so much.  It's easy to talk about developing critical thinking and learning ability but reality most people go to good schools, good colleges excepting to make a good career.   EDTech basically capitalizes on that and prints money. But the problem with printing money is that you always want more growth. The basic idea of EdTech is great but the implementation is greedy and pathetic but it makes sense for a country like India.  1/4th of the country is still considered uneducated. That's 35.19 crore people. Having an education is being lucky in India, and parents want to provide the best for their kids (ultimately so they get a good job and make more money.)  Idk, I guess I want to say that it's a bit precious thinking that \"the whole point of education is developing critical thinking and learning ability.\" I'm a college dropout and everyone thought I would never be able to turn my life around because I don't have an education. (Plot twist - I eventually did.)",
    "sentiment": "negative",
    "score": 0.5388
  },
  {
    "comment": "Lets do it.",
    "sentiment": "positive",
    "score": 0.5445
  },
  {
    "comment": "Yep there are similarities. Though the difference is that OpenAI meant to be a non-profit because of the \"greater good\" and then Microsoft managed to convince OpenAI to allow  it to make a profit.",
    "sentiment": "positive",
    "score": 0.408
  },
  {
    "comment": "Yup yup. There can be profitable non-profits, but CodeChef wasn't it. Its usefulness from the beginning has been tangential. So I haven't touched upon that aspect.  Also, CodeChef is 100% not a golden goose else unacademy wouldn't have given away 70% of the company for free.",
    "sentiment": "neutral",
    "score": 0.4443
  },
  {
    "comment": "I liked hackerrank better.",
    "sentiment": "positive",
    "score": 0.62
  },
  {
    "comment": "[removed]",
    "sentiment": "negative",
    "score": 0.3773
  },
  {
    "comment": "Thanks, love the kind words. I enjoy a lot writing it as well :)",
    "sentiment": "positive",
    "score": 0.9913
  },
  {
    "comment": "The mods don't like it when I do it, so just dropping the source at the end :) Since I'm posting regularly here regular readers sooner or later might get around to subscribing.",
    "sentiment": "negative",
    "score": 0.538
  },
  {
    "comment": "yea that's the thing, whatever VC funded Indian edtech touches, it destroys it.",
    "sentiment": "negative",
    "score": 0.8373
  },
  {
    "comment": "This comment has been removed to protest Reddit's hostile treatment of users, mods and third party app developers.",
    "sentiment": "negative",
    "score": 0.8603
  },
  {
    "comment": "This comment has been removed to protest Reddit's hostile treatment of users, mods and third party app developers.",
    "sentiment": "negative",
    "score": 0.8603
  },
  {
    "comment": "Agreed..   There are few jobs that pays for developing critical thinking and subject knowledge..   These days, we (as a country) don't have many such jobs, few those exists are concentrated in Metros or IT or Specialty Hubs..     So what a common student do is, he looks for earnings opportunities immediately out of college. The system is also configured in such a way that if you take gap year/s after college, you're not employer's first choice (I don't know the reason for this). So now a Physics/Chemistry Post-Graduate even with excellent grades and subject understanding is working in IT Industry or in a Bank. this is not something bad but the one question we should ask should be **\"Why are these Physics/Chemistry PG students are not looking for job opportunities in their field OR enthusiastic about making career in their own field?\"**   Answers that you would find more probably is that, **\"because there are none..\"**",
    "sentiment": "negative",
    "score": 0.5566
  },
  {
    "comment": "This comment has been removed to protest Reddit's hostile treatment of users, mods and third party app developers.",
    "sentiment": "negative",
    "score": 0.8603
  },
  {
    "comment": "AI can make this happen Gilfoyle. I have been thinking a lot about this.",
    "sentiment": "negative",
    "score": 0.4576
  },
  {
    "comment": "Your post doesn't seem to reflect that there are profitable non profit at all. Tangential or not.   And with that level of surety I assume you have some sort of access to this deal or financials etc. Because in the world of business bottom line profits are not the only thing drives everything. Tangential or not.",
    "sentiment": "neutral",
    "score": 0.5045
  },
  {
    "comment": "clearly you haven't been part of the CC community before its acquisition",
    "sentiment": "neutral",
    "score": 0.5109
  },
  {
    "comment": "What you probably mean is a for-profit within the ambit of a VC-funded edtech. Right now, since it's privately owned mostly by the founders, it has no incentive to keep growing. It's happy earning 1000 crores every year. Incentives change when investors are involved.",
    "sentiment": "positive",
    "score": 0.4852
  },
  {
    "comment": "All that needed is a good aggregator of free resources and a good way to market it",
    "sentiment": "positive",
    "score": 0.9648
  },
  {
    "comment": "What does that mean though? You cannot just be \"radical\" and solve India's education problem. It's way more systematic and cultural and will take at least a few decades to change.",
    "sentiment": "negative",
    "score": 0.4015
  },
  {
    "comment": "Ha ha that’s an issue.  But I am all in for saying FU to EdTechs",
    "sentiment": "negative",
    "score": 0.456
  },
  {
    "comment": "It’s already happening.  Check out khan academy’s blog about integrating their platform with chatGPT for kids.",
    "sentiment": "positive",
    "score": 0.425
  },
  {
    "comment": "There is no reason for my post to reflect that because I'm not writing a dissertation that covers the types of non-profits in detail. Instead giving one or two perspectives on how non-profits function within a company's framework.  I'm not a full-time journalist so I can't find out what's not already in the public domain. What I can do, however, is analyse and make educated guesses. There's every indication that CodeChef isn't a golden goose (CodeChef itself has said that it needs to become financially viable now that it's separating from Unacademy). If it were, it would be a for-profit within Unacademy -- the latter is desperate at the moment to make its units profitable. It wouldn't rid itself off a profitable entity.",
    "sentiment": "negative",
    "score": 0.5707
  },
  {
    "comment": "Well I have used codechef.. In early 2014 and 2015s.. Even then I liked hackerranks interface and useability better.   Haven't used either post 2019.   So clearly the opposite of your statement.",
    "sentiment": "negative",
    "score": 0.4266
  },
  {
    "comment": "Does GFG really earn 1000 crores a year?",
    "sentiment": "positive",
    "score": 0.4756
  },
  {
    "comment": "This comment has been removed to protest Reddit's hostile treatment of users, mods and third party app developers.",
    "sentiment": "negative",
    "score": 0.8603
  },
  {
    "comment": "Yes, well aware. But currently not available everywhere.",
    "sentiment": "positive",
    "score": 0.5404
  },
  {
    "comment": "That's their revenue according to the YourStory article above. YourStory isn't a very reliable outlet by itself but they've interviewed the founder here and these financials can be verified so I see no reason to doubt it.",
    "sentiment": "neutral",
    "score": 0.4366
  },
  {
    "comment": "Okay cool quote, but still no practical solution.",
    "sentiment": "neutral",
    "score": 0.5088
  },
  {
    "comment": "HDFC and technology driven innovation should not be in same sentence.",
    "sentiment": "negative",
    "score": 0.3503
  },
  {
    "comment": "Tata is not the oldest conglomerate. In fact its not even in the top 20 oldest company in India.  Also this is an futile excercise. Good for youtube live and engaging viewer.",
    "sentiment": "neutral",
    "score": 0.3913
  },
  {
    "comment": "Honestly pretty useless question to give a serious thought about. Not to mention no one here can predict that.",
    "sentiment": "neutral",
    "score": 0.4717
  },
  {
    "comment": "Tata and HDFC yes, Infosys is far too niche to even think in 20 year terms, other two is family run and can be messed up quite easily by one of the children.",
    "sentiment": "negative",
    "score": 0.424
  },
  {
    "comment": "This might be tangential to your question, but I think an aggressive index like Nifty Next 50 is a great option. You don't need to worry about the constituent companies as they will get filtered out/added in due course.",
    "sentiment": "positive",
    "score": 0.5169
  },
  {
    "comment": "Bikaner Wala    MDH Masale /s",
    "sentiment": "positive",
    "score": 0.479
  },
  {
    "comment": "IRCTC lol. I don’t think it will be there in 40-50 years.",
    "sentiment": "neutral",
    "score": 0.4705
  },
  {
    "comment": "I want to mention 2 point  1)Remember Nobody can predict the future...World is ever changing ......\"Too Big to fail\" is myth...Empire build and Fall....  2) Let's say this all company survive...but the some will give return below the FD....IMHO It is not good parameter to judge ...You are risking your money in some non-growth area.....Growth is essential in investing world...As example Take SBI .....nobody in wildest dream think that Government allowed to SBI to bankrupt...It is a easy bet that SBI will last long till End of the world...But what will the Stock price...You check yourself....SBI FD can give your more return that SBI Share...",
    "sentiment": "negative",
    "score": 0.595
  },
  {
    "comment": "Considering it is 100 years from now, no AI based companies? And you also asked an AI on that same so this also shows where the world is navigating their next.",
    "sentiment": "negative",
    "score": 0.4313
  },
  {
    "comment": "100 years is a huge timespan. And progress is always exponential. Look where the world progressed from 1600-1900s, then 1900-till now.   No one can predict what'll happen in the next 100 years.",
    "sentiment": "negative",
    "score": 0.4164
  },
  {
    "comment": "Raj Rayon /s",
    "sentiment": "positive",
    "score": 0.4818
  },
  {
    "comment": "United Spirits, Globus Spirits",
    "sentiment": "positive",
    "score": 0.7562
  },
  {
    "comment": "In 100 years AI may not be there",
    "sentiment": "negative",
    "score": 0.4746
  },
  {
    "comment": "https://stockmarketk.quora.com/?ch=10&oid=3797446&share=396067ef&srid=u9c94o&target_type=tribe",
    "sentiment": "positive",
    "score": 0.5409
  },
  {
    "comment": "Haha, can we also get behind ICICI prudential MF's customer account page as well. It looks like the UI was designed a decade ago.",
    "sentiment": "positive",
    "score": 0.4137
  },
  {
    "comment": "Their internet banking is stuck the same reason Amazon UI is stuck.  They got something that works well and is familiar to their customers, changing it will alienate them and open a hole for their competitors to suck some away.",
    "sentiment": "negative",
    "score": 0.6043
  },
  {
    "comment": ">HDFC and technology driven innovation  lol",
    "sentiment": "positive",
    "score": 0.606
  },
  {
    "comment": "Which ones are the oldest ?",
    "sentiment": "negative",
    "score": 0.4466
  },
  {
    "comment": "[deleted]",
    "sentiment": "negative",
    "score": 0.3849
  },
  {
    "comment": ">Nifty Next 50  Adani says hi :)  I stopped my SIPs in it just because of high weightage to adani .",
    "sentiment": "negative",
    "score": 0.4393
  },
  {
    "comment": "SBI share is up 125% in last five years. FD can't beat this lol.",
    "sentiment": "positive",
    "score": 0.3584
  },
  {
    "comment": "I think even though the UI is very old, it is still functional. I've seen banks migrate to new UI which confuses customers more",
    "sentiment": "negative",
    "score": 0.4349
  },
  {
    "comment": "but it lacks essential features. you cannot check existing emi’s you have to give them call to check. you cannot check loan schedule, credit card transactions are not updated frequently. ICICI net banking is way ahead of them.",
    "sentiment": "neutral",
    "score": 0.463
  },
  {
    "comment": "Are you complaining about the stock index being volatile? Gains are to be expected over a long term, and such fluctuations aren't unexpected",
    "sentiment": "negative",
    "score": 0.5726
  },
  {
    "comment": "Then you have to choose an index that is immune to these kind of companies or invest in an active fund and hope that fund stays for 100 years and performs. Choose your poison basically.",
    "sentiment": "negative",
    "score": 0.6455
  },
  {
    "comment": "I agree and Yes Bank in Nifty 50.  What I want to say is there's no silver bullet.   You can choose to invest in specific companies for 100 years and those companies might close down or grow creating huge wealth.  You can choose an active fund and that might remain around for 100 years or the AMC might close in between.  Or you can choose an index and stick to it. Time will add good companies and remove bad ones. That's the advantage of index funds, you don't have to worry about company, AMC, fund manager. But it brings the risks that you mentioned.  I put forward my opinion that for 100 years an index is a good bet when compared to individual companies.",
    "sentiment": "negative",
    "score": 0.424
  },
  {
    "comment": "Yes, that's a possibility too. They had a beta version of their website running few weeks ago, that was very modern and actually had pretty good UI. Hopefully they release the final version of that new UI soon.",
    "sentiment": "positive",
    "score": 0.877
  },
  {
    "comment": "I can do all that but I get your point.  It’s pretty difficult for me to navigate and figure out what’s where on ICICI NetBanking.  They might have a better product but they redesigned the site at-least twice since I have been using it and I don’t have any familiarity.  Familiarity brings comfort and in turn brand loyalty.",
    "sentiment": "negative",
    "score": 0.5298
  },
  {
    "comment": "yup that's true.  The reason I do index investing is for peace of mind, but currently nifty next 50 makes me uncomfortable due to large adani exposure. So I have stopped my sip & instead allocated sip to nifty 50.   Maybe in future whenever adani fiasco settles or it's weight gets decreased, I will restart the SIP.",
    "sentiment": "negative",
    "score": 0.4481
  },
  {
    "comment": "Next conspiracy theory. Why are all the Nifty 50 index funds investing in the same set of companies in identical proportions.",
    "sentiment": "negative",
    "score": 0.5338
  },
  {
    "comment": "They r blue chip companies. Simple   Look at US its mostly tech companies.",
    "sentiment": "positive",
    "score": 0.477
  },
  {
    "comment": "You most likely would have looked at large cap funds ( or in some cases, flexi cap). Ofcourse they're bound to have allocation for these because of market cap.   The heavyweight towards financial companies is normal, even NIFTY50 (100) has more than 35% weightage to Financial Services.",
    "sentiment": "negative",
    "score": 0.3501
  },
  {
    "comment": "Bluechip companies; also the downside protection and kind of trading volume MFs need, only large companies can provide.",
    "sentiment": "positive",
    "score": 0.4153
  },
  {
    "comment": "Mutual funds have objective to either follow or outperform a benchmark index. In case of large cap category, fund managers have to take allocations of the companies which are stars of the index itself. Deviation from the actual index does not work well in case of Large cap category. Hence, you will fund same companies in different active large cap funds and in large cap allocation of other category funds. And this is the reason why financial advisors are recommending index funds.",
    "sentiment": "negative",
    "score": 0.4354
  },
  {
    "comment": "Simple it's better to be average, than to underperform/outperform. So herd mentality. That's why most funds hug their index with minor changes in allocation/portfolio.",
    "sentiment": "negative",
    "score": 0.5415
  },
  {
    "comment": "Yeah the investable universe is small for institutional investors due to the size and liquidity concerns. Index funds are great for most people. My concerns with index funds in India is about the not so diversified index. Plus the presence of PSUs and cyclicals in the index. So I keep regularly buying quality firms in the index like HDFC bank, TCS, HCL etc. This means that I will have to hold tight during periods of underperformance when the cyclicals, capital goods are soaring, just lets me sleep better at night.",
    "sentiment": "positive",
    "score": 0.6825
  },
  {
    "comment": "I believe professionals prosper when they work where they are the strongest. The MF people have utilised their area of expertise to analyse the companies and chose the best out of them. Their area of expertise is finance and hence majority of them have financial companies in them. It’s their intuition and they know ins and outs of it. It gives them the top advantage over any other person.   I feel we retail investors can utilise our own area of expertise to analyse the companies in our field and get an advantage over others.   Disclaimer: It’s not a fact, just my opinion on the situation.",
    "sentiment": "positive",
    "score": 0.5244
  },
  {
    "comment": "There is too much money chasing too few good companies in our market.",
    "sentiment": "negative",
    "score": 0.4697
  },
  {
    "comment": "Cleaning corporation shown in MF portfolio isn’t a stock just money of the MF with the stock exchange in between transactions.",
    "sentiment": "negative",
    "score": 0.4419
  },
  {
    "comment": "Average reddit user ☕🫡",
    "sentiment": "positive",
    "score": 0.4341
  },
  {
    "comment": "Parag Parikh fund is nothing but 60% S30 and 40% NASDAQ100 index funds.",
    "sentiment": "neutral",
    "score": 0.3917
  },
  {
    "comment": "Good first step at comparison.   However, in a real world with capacity and liquidity constraints, start comparing the active weights against their benchmark - how underweight or overweight is this fund on this particular security, against the benchmark reflective of the investible universe (for example, Nifty 50 for a large cap mutual fund)  That will start telling you a story",
    "sentiment": "negative",
    "score": 0.4322
  },
  {
    "comment": "It seems you have only looked at large cap funds which  is a tight space; only 100 companies. As per regulation 80% of AUM should be deployed here. Moreover, Fund manager do not deviate too much from benchmark in terms of sector allocation. Consider all this you end up with these set of companies.",
    "sentiment": "neutral",
    "score": 0.4131
  },
  {
    "comment": "Lol ..  CBI please help",
    "sentiment": "positive",
    "score": 0.7229
  },
  {
    "comment": "Which are some good nifty 50 index funds?",
    "sentiment": "positive",
    "score": 0.6891
  },
  {
    "comment": "Most comments say since it is bluechip companies and most MFs looks like Large Cap and Flexi caps hence I see the same companies. So does it also mean I can pick up any of these MFs?",
    "sentiment": "negative",
    "score": 0.5137
  },
  {
    "comment": "But there are other LArge Caps too especially from FMCG, Automobile, and Materials domains. But I don't see the other ones In these MFs. Any ideas.",
    "sentiment": "negative",
    "score": 0.4206
  },
  {
    "comment": "Lmao sharat absolutely crushed the image of PPFAS for me. He was the first to point this out. They charge 0.77 TER for what can be done at 0.2 by you.",
    "sentiment": "negative",
    "score": 0.5634
  },
  {
    "comment": "It was true, but if you recently see how they are one of the few mf houses which started covered call to get more profit, I think they do value add. Only DSP, ICICI and maybe one other mf does this kind of trading in their funds.",
    "sentiment": "negative",
    "score": 0.4438
  },
  {
    "comment": "Solid case for CID",
    "sentiment": "positive",
    "score": 0.5761
  },
  {
    "comment": "##CBSE_for_NIFTY",
    "sentiment": "positive",
    "score": 0.5284
  },
  {
    "comment": "All the index funds are same. These are called passive funds, unlike active funds there is no much dependency on fund manager. So pick a fund which has lower expense ratio whn compared with peers",
    "sentiment": "neutral",
    "score": 0.6391
  },
  {
    "comment": "UTI direct growth",
    "sentiment": "positive",
    "score": 0.715
  },
  {
    "comment": "Personally I would just pick an index fund like nifty 100 with low TER and then allocate remaining in 2 small cap MF that too by looking at alpha, beta, risk ratios over atleast 3 years periods. Dont go by rankings u see on websites and TER also I wouldnt give much weight for small cap MFs",
    "sentiment": "positive",
    "score": 0.375
  },
  {
    "comment": "[removed]",
    "sentiment": "negative",
    "score": 0.3773
  },
  {
    "comment": "The difference lies in weightage. You should look at what is the weightage for each of these stocks. Just the number of stocks has no meaning. It depends on how much percentage of stocks do you hold and when you trade.",
    "sentiment": "neutral",
    "score": 0.499
  },
  {
    "comment": "Every fund manager has their own critierias to invest in some \"safe\" stocks. Maybe those stocks you're referring aren't satisfying their criterias.",
    "sentiment": "positive",
    "score": 0.3748
  },
  {
    "comment": "That's why they show consistent performance. Why beat the index when you can hug the index?",
    "sentiment": "negative",
    "score": 0.4113
  },
  {
    "comment": "I was going through his Twitter feed. Did he delete that tweet ?",
    "sentiment": "negative",
    "score": 0.4283
  },
  {
    "comment": "With <1% weightage, what's the point? Doesn't it alter the risk profile of the fund? What's the downside of it?",
    "sentiment": "negative",
    "score": 0.5228
  },
  {
    "comment": "Daya darwaza tord do",
    "sentiment": "positive",
    "score": 0.4758
  },
  {
    "comment": "ICSC:  am i joke to you?",
    "sentiment": "negative",
    "score": 0.5363
  },
  {
    "comment": "This. The only difference between all the funds is their tracking error and UTI has proved to be the best till now.",
    "sentiment": "positive",
    "score": 0.5884
  },
  {
    "comment": "I agree that index funds seem better in case of large cap category. But, go for Nifty 50 index and Nifty Next 50 index separately. Nifty 100 index does not do justice to companies beyond Nifty 50 as the biggest 20 companies command lions share of the Nifty 100 index.",
    "sentiment": "negative",
    "score": 0.3821
  },
  {
    "comment": "This is exactly what I do. Check beta, alpha and then other risk ratios over 3 and 5 year periods. You're spot on.",
    "sentiment": "neutral",
    "score": 0.3393
  },
  {
    "comment": "[removed]",
    "sentiment": "negative",
    "score": 0.3773
  },
  {
    "comment": "Historically banking stocks are the least safe long-term bluechip investments  Nothing wrong with making a quick buck on some financial companies, but you should get out within a decade before whenever the next financial crisis is going to be. They aren't good pension / early retirement investments.",
    "sentiment": "negative",
    "score": 0.4132
  },
  {
    "comment": "Low key Big Brain.",
    "sentiment": "positive",
    "score": 0.4765
  },
  {
    "comment": "[PPFAS, a glorified asset allocator](https://twitter.com/rsharat1/status/1409012005189472258?s=19)  Edit: He told it a year back hence you couldn't find it I guess.",
    "sentiment": "negative",
    "score": 0.476
  },
  {
    "comment": "My point was that lets say they are nothing more than glorified allocators. But they weren't stopping their competition from doing the same. This fund house is. And has been a constant innovator which has consistently outperformed their peers when nothing was stopping their peers from replicating their strategy.",
    "sentiment": "neutral",
    "score": 0.4112
  },
  {
    "comment": "I initially had it seperate i.e. 50 and next 50 but now moving to nifty 100.   >biggest 20 companies command lions share of the Nifty 100 index.  Thats how index investing should work isnt it",
    "sentiment": "negative",
    "score": 0.4385
  },
  {
    "comment": "[removed]",
    "sentiment": "negative",
    "score": 0.3773
  },
  {
    "comment": "Which are the safe long term or investments ?",
    "sentiment": "positive",
    "score": 0.3869
  },
  {
    "comment": "That's what these fund managers do. Switching among these stocks when they find good opportunity.",
    "sentiment": "positive",
    "score": 0.6631
  },
  {
    "comment": "True.",
    "sentiment": "positive",
    "score": 0.7061
  },
  {
    "comment": "What I am implying is that investing in Nifty 100 index does not help you with diversification because the allocation to Nifty 50 stocks will govern the fund. The rest stocks are not contributing to the index in a constructive manner. In that case, Nifty 50 index is better.",
    "sentiment": "negative",
    "score": 0.5098
  },
  {
    "comment": "[removed]",
    "sentiment": "negative",
    "score": 0.3773
  },
  {
    "comment": "It depends how old you are, how close to retirement, your risk tolerance and your goals (how much you want to live off from your savings).   The “gold standard” for safe investments is government bonds, but unless you’re very young and plan to retire in a long time it’s a waste of an investment because it will pay out a tiny bit of profit in many decades… But it will pay out, usually 100% of the time, and above inflation, making it incredibly safe but boring.  —-  The reason I don’t like bank shares in particular is because they have special rules that don’t apply to other asset and investment classes. If a bank goes bust (and both ICICI & HDFC have been caught in major scandals involving their board of directors recently), the government will take shareholders investments and depositors money and use it to “bail out” the bank (its actually called a “bail in”), they don’t actually use government money or RBI funds.  It will then take many decades for the bank shares to reach their previous peak, longer than my lifetime or yours. To an outside observer it looks like the shares are incredibly stable or safe but they aren’t, they’re just in a constant state of incredibly slow recovery.",
    "sentiment": "negative",
    "score": 0.5025
  },
  {
    "comment": "Then go with nifty 100 equal weight   But index investing is not about diversification its about the empirical evidence that index investing beats  active investing 80% of times.",
    "sentiment": "neutral",
    "score": 0.3787
  },
  {
    "comment": "[removed]",
    "sentiment": "negative",
    "score": 0.3773
  },
  {
    "comment": "someone needs to verify this... any source? external link?",
    "sentiment": "neutral",
    "score": 0.3929
  },
  {
    "comment": "Thanks for your inputs",
    "sentiment": "positive",
    "score": 0.9641
  },
  {
    "comment": "Well, you are the boss of your own money. We all have our perspective. At the end, we all are aiming for the same goal of consistent returns with less risk. Happy investing.",
    "sentiment": "positive",
    "score": 0.6552
  },
  {
    "comment": "Is there any data for such a conclusion in India?",
    "sentiment": "negative",
    "score": 0.363
  },
  {
    "comment": "> nifty 100 equal weight  Which funds do you recommend?",
    "sentiment": "positive",
    "score": 0.495
  },
  {
    "comment": "[removed]",
    "sentiment": "negative",
    "score": 0.3773
  },
  {
    "comment": "[https://www.outlookindia.com/website/story/bail-in-at-what-cost/305307](https://www.outlookindia.com/website/story/bail-in-at-what-cost/305307)  Indian financial sector and especially banking sector has an inherent strength. Ordinary Indian believes in it. Even after accepting corruption and favorable terms for the big and mighty, average Indian feels his money is safe in Indian banks.   |  This trust and resulting brand value is very difficult to quantify in monetary terms. The value will be understood when we look at it from the other side - how much will it cost to gain trust of 1.3 billion people and to sustain it.  &#x200B;  To understand the implications of bail-in provisions in the proposed Financial Resolution and Deposit Insurance Bill 2016, one need to have a feel of what this mean to an ordinary customer. A bail-in is typically rescuing a financial institution when it is about to fail, by forcing its creditors and depositors pay for the loss of the financial institution. In other words, a part of your money deposited in the bank will be utilized to cover for the losses incurred by the bank or the financial institution.  &#x200B;  All these years, our government while trying to get more people into banking system (financial inclusion) was saying your money is safe and we guarantee it. With bail-in, what next ?  &#x200B;  A bail-in is just the opposite of a bail-out. In bail-out a bank in crisis is rescued by external parties without affecting depositors. Here government comes to the rescue using taxpayers money.  This was what was happening in the past. The government now propose that the investors and depositors in the bank to pay for the losses before taxpayers.  &#x200B;  Theoretically this may be correct, open to academic debate. In reality, millions of poor customers in the Indian banking system know no theory. All they know is that their money is safe in the bank. This is due to deposit insurance.  &#x200B;  The concept of insuring bank deposits was taken seriously after the failure of banks in 1960s. This gathered momentum with Deposit Insurance Act, 1961. Reserve Bank Of India took care of deposit insurance in the beginning. After several forms to suite changing times, Deposit Insurance and Credit Guarantee Corporation (DICGC) came into existence in 1978.    &#x200B;  DICGC insures all bank deposits up to Rs. 100,000 in a bank. If the customer has accounts in different banks, all of those accounts are insured to a maximum of Rs 1,00,000. The insurance premium is paid by the insured banks itself. This means that the benefit of deposit insurance protection is made available to the depositors or customers of banks free of cost.  &#x200B;  There are arguments favoring bail-in for India quoting Cyprus and other countries who went for bail-in. These countries got into financial crisis following recession in 2008. We should remember, in those days, we took pride in our banking system as very different and fundamentally strong.  Moreover none of these countries are comparable to us in terms of numbers and scale.  &#x200B;  Only a small percentage of the population who use banks in India know about Deposit Insurance and Credit Guarantee Corporation (DICGC) and that only up to Rs100000 is insured. But for all practical purpose they believe their money is safe and is true.  To change this belief and to rebuild it will be a very costly exercise.  &#x200B;  Courtesy Outlook India",
    "sentiment": "negative",
    "score": 0.5281
  },
  {
    "comment": "200%",
    "sentiment": "positive",
    "score": 0.6192
  },
  {
    "comment": "Becoz of prev comment I mentioned nifty 100 equal weight but I am not a fan of equal weight",
    "sentiment": "neutral",
    "score": 0.3957
  },
  {
    "comment": "[removed]",
    "sentiment": "negative",
    "score": 0.3773
  },
  {
    "comment": "[removed]",
    "sentiment": "negative",
    "score": 0.3773
  },
  {
    "comment": "Mutual fund accounts for principles also and because of recent rate hikes all these bonds have lost some principle as of LTP, i.e. the % you see is what you get if you sell all these bonds today net or how much is the NAV today. Keeping everything else constant as time passes and these bonds mature you will see a bump in NAV and these will go back to their regular rates.  As for shreeram they are quoting just how much interest you will get keeping the principle at 100%, but if you try to sell bond as of today you would see less return as they would not sell at 100.",
    "sentiment": "negative",
    "score": 0.4873
  },
  {
    "comment": "The NAV of bond mutual funds go up and down due to the price of bond which in turn is influenced by the prevailing interest rate. Thus, even if you hold directly a corporate bond fund, the price of it will change in the secondary market and if you are going to sell the bond, then you will get the price which is there in the market.",
    "sentiment": "negative",
    "score": 0.5043
  },
  {
    "comment": "One thing that is always missed in these discussions is that the interest rate you see for FDs is the future rate that you would get in an year if you invested today, while the returns for MFs is what you would have gotten today if you invested a year back.  Liquid funds had a return of about 6-8% while FD rates dropped to 4%. Now we see FD rates rise, but Liquid funds are at 4%.",
    "sentiment": "negative",
    "score": 0.5145
  },
  {
    "comment": "Adding to this. You also have to be aBle to exit the position. Illiquid bonds will have to compensate liquidity premium in terms of rates.",
    "sentiment": "positive",
    "score": 0.4386
  },
  {
    "comment": "But what happens to the interest earned? Shouldn't it fold into the MF's NAV (for growth option)?",
    "sentiment": "negative",
    "score": 0.4133
  },
  {
    "comment": "Please point out a single liquid fund with a 6% return in the last one year.  In fact provide the period with links where liquid fund yielded 6-8%.",
    "sentiment": "positive",
    "score": 0.4046
  },
  {
    "comment": "It will fold in when the interest is actually received.",
    "sentiment": "positive",
    "score": 0.506
  },
  {
    "comment": "Mutual funds **accrue** the interest on a daily basis and is included in the NAV.",
    "sentiment": "positive",
    "score": 0.5789
  },
  {
    "comment": "I believe the person above is saying that the LF trailing returns were ~6% when FDs dropped to ~4%, and LF trailing returns show ~4% when FDs are showing better returns. Not that LFs are showing 6% return in last one year.",
    "sentiment": "negative",
    "score": 0.3786
  },
  {
    "comment": "Name one liquid fund with a one year trailing return of 6% with appropriate links.    The trailing one year returns have not exceeded 4%.",
    "sentiment": "positive",
    "score": 0.4614
  }
]